In [1]:
#dependencies

import pandas as pd

In [2]:
#Use Pandas to read data
age_data = pd.read_csv("../Resources/Age_Data.csv")

In [3]:
#print to view
age_data.head()

   Unnamed: 0  Year        City        Age Range  Number in Range
0           0  2018  Albany, NY   18 to 24 Years            21091
1           1  2018  Albany, NY  75 Years & Over             5906
2           2  2018  Albany, NY   45 to 54 Years            10514
3           3  2018  Albany, NY    Under 5 Years             5491
4           4  2018  Albany, NY   65 to 74 Years             6670

In [4]:
#look for missing values
#awesome to see!
age_data.count()

Unnamed: 0         16236
Year               16236
City               16236
Age Range          16236
Number in Range    16236
dtype: int64

In [5]:
#get a list of all of our columns for easy reference
age_data.columns

Index(['Unnamed: 0', 'Year', 'City', 'Age Range', 'Number in Range'], dtype='object')

In [6]:
#collect data that includes year 2015 & age of 25-34
#'Year' = 2017
#'Age Range' = 25 t0 34 Years

age_data_2017_df = age_data.loc[(age_data["Year"] == 2017) & (age_data["Age Range"] == "25 to 34 Years")]

In [7]:
#print
age_data_2017_df.head()

     Unnamed: 0  Year        City       Age Range  Number in Range
14           14  2017  Albany, NY  25 to 34 Years            16607
80           80  2017  Albany, NY  25 to 34 Years            16607
146         146  2017  Albany, NY  25 to 34 Years            16607
212         212  2017  Albany, NY  25 to 34 Years            16607
278         278  2017  Albany, NY  25 to 34 Years            16607

In [8]:
#drop column "Unnamed: 0"
#add at end inplace=True -> to allow panda to edit the original DF
age_data_2017_df.drop(columns=["Unnamed: 0"], inplace=True)

In [9]:
#drop duplicates!
#missed the first time
#use city as subset - since it varies
#add at end inplace=True -> to allow panda to edit the original DF
#inplace=False -> does not affect the original DF
age_data_2017_df.drop_duplicates(subset="City", keep="first", inplace=True)

In [10]:
#print
age_data_2017_df

       Year                             City       Age Range  Number in Range
14     2017                       Albany, NY  25 to 34 Years            16607
410    2017                      Atlanta, GA  25 to 34 Years           100614
1202   2017                   Boise City, ID  25 to 34 Years            34039
1598   2017                       Boston, MA  25 to 34 Years           165832
1994   2017                      Buffalo, NY  25 to 34 Years            49207
2390   2017                    Charlotte, NC  25 to 34 Years           155229
2786   2017                      Chicago, IL  25 to 34 Years           542190
3182   2017                   Cincinnati, OH  25 to 34 Years            57700
3578   2017                     Columbus, OH  25 to 34 Years           182309
3974   2017                       Dallas, TX  25 to 34 Years           257313
4370   2017                       Denver, CO  25 to 34 Years           161633
4766   2017                      Detroit, MI  25 to 34 Years           103202
5162   2017                 Grand Rapids, MI  25 to 34 Years            37924
5558   2017                   Harrisburg, PA  25 to 34 Years             8535
5954   2017                     Hartford, CT  25 to 34 Years            20176
6350   2017                      Houston, TX  25 to 34 Years           427232
6746   2017  Indianapolis city (balance), IN  25 to 34 Years           147561
7142   2017                 Jacksonville, FL  25 to 34 Years           148426
7538   2017                    Las Vegas, NV  25 to 34 Years            95322
7934   2017                  Los Angeles, CA  25 to 34 Years           714226
8330   2017                        Miami, FL  25 to 34 Years            77577
8726   2017                    Nashville, NC  25 to 34 Years              481
9122   2017                  New Orleans, LA  25 to 34 Years            71100
9518   2017                     New York, NY  25 to 34 Years          1551985
9914   2017                      Orlando, FL  25 to 34 Years            61102
10310  2017                 Philadelphia, PA  25 to 34 Years           299973
10706  2017                      Phoenix, AZ  25 to 34 Years           255124
11102  2017                   Pittsburgh, PA  25 to 34 Years            67339
11498  2017                     Portland, OR  25 to 34 Years           128861
11894  2017                      Raleigh, NC  25 to 34 Years            87741
12290  2017                     Richmond, VA  25 to 34 Years            45872
12686  2017                      Roanoke, VA  25 to 34 Years            15339
13082  2017                   Sacramento, CA  25 to 34 Years            90201
13478  2017                    San Diego, CA  25 to 34 Years           281489
13874  2017                San Francisco, CA  25 to 34 Years           207492
14270  2017                      Seattle, WA  25 to 34 Years           167622
14666  2017                      Spokane, WA  25 to 34 Years            34328
15062  2017                    St. Louis, MO  25 to 34 Years            61937
15458  2017                     Syracuse, NY  25 to 34 Years            22964
15854  2017                        Tampa, FL  25 to 34 Years            62853

In [11]:
#export DF into a .csv
age_data_2017_df.to_csv("2017_all_cities_age_data.csv")